In [45]:
import pandas as pd
import numpy as np

In [46]:
dados_one = {
    "ID": [1, 2, 3, 4, 5],
    "Nome": ["Ana", "Carlos", "Lucas", "Fernanda", "Mariana"],
    "Idade": [23, 30, 25, 28, 22],
    "Cidade": ["São Paulo", "Rio de Janeiro", "Curitiba", "Porto Alegre", "Salvador"]
}

In [47]:
dados_two = {
    "ID": [6, 7, 8, 9, 10],
    "Nome": ["João", "Paulo", "Pedro", "Amanda", "Rafael"],
    "Idade": [27, 35, 32, 22, 29],
    "Cidade": ["Fortaleza", "Belo Horizonte", "Recife", "Brasilia", "Manaus"]
}

In [48]:
dados_three = {
    "ID": [11, 12, 13, 14, 15],
    "Nome": ["Juliana", "Sérgio", "Gabriela", "Eduardo", "Carla"],
    "Idade": [26, 33, 28, 31, 24],
    "Cidade": ["Natal", "Cuiaba", "Vitória", "Maceió", "João Pessoa"]
}

In [49]:
dados_four = {
    "ID": [16, 17, 18, 19, 20],
    "Nome": ["Ricardo", "Tânia", "Elena", "Marcos", "Beatriz"],
    "Idade": [29, 26, 34, 27, 25],
    "Cidade": ["Florianópolis", "Goiânia", "Aracaju", "Campo Grande", "Belém"]
}

In [50]:
df_aba1 = pd.DataFrame(dados_one)
df_aba2 = pd.DataFrame(dados_two)
df_aba3 = pd.DataFrame(dados_three)
df_aba4 = pd.DataFrame(dados_four)

In [51]:
df_aba1.head()

   ID      Nome  Idade          Cidade
0   1       Ana     23       São Paulo
1   2    Carlos     30  Rio de Janeiro
2   3     Lucas     25        Curitiba
3   4  Fernanda     28    Porto Alegre
4   5   Mariana     22        Salvador

In [52]:
caminho_arquivo = fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx"

In [53]:
with pd.ExcelWriter(caminho_arquivo, engine="openpyxl") as writer:
    df_aba1.to_excel(writer, sheet_name="Dado1", index=False)
    df_aba2.to_excel(writer, sheet_name="Dado2", index=False)
    df_aba3.to_excel(writer, sheet_name="Dado3", index=False)
    df_aba4.to_excel(writer, sheet_name="Dado4", index=False)

In [54]:
print(f"Arquivo Excel com 4 abas criadas!")

Arquivo Excel com 4 abas criadas!